[
  {
    "section_id" : 1,
    "reference": "عن علقمة بن وقاص الليثي، يقول: سمعت عمر بن الخطاب رضي الله عنه على المنبر قال: سمعت رسول الله صلى الله عليه وسلم يقول:",
    "content": "أإنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى دنيا يصيبها، أو إلى امرأة ينكحها، فهجرته إلى ما هاجر إليه."
  },
  {
    "section_id" : 1,
    "reference": "عن عائشة أم المؤمنين رضي الله عنها، أن الحارث بن هشام رضي الله عنه سأل رسول الله صلى الله عليه وسلم فقال: يا رسول الله، كيف يأتيك الوحي؟ فقال رسول الله صلى الله عليه وسلم:",
    "content": "أحيانا يأتيني مثل صلصلة الجرس، وهو أشده علي، فيفصم عني وقد وعيت عنه ما قال، وأحيانا يتمثل لي الملك رجلا فيكلمني فأعي ما يقول."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عباس، قال:",
    "content": "كان رسول الله صلى الله عليه وسلم أجود الناس، وكان أجود ما يكون في رمضان حين يلقاه جبريل، وكان يلقاه في كل ليلة من رمضان فيدارسه القرآن، فلرسول الله صلى الله عليه وسلم أجود بالخير من الريح المرسلة."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عمر، رضي الله عنهما قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، والحج، وصوم رمضان."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم قال:",
    "content": "الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد الله بن عمرو رضي الله عنهما، عن النبي صلى الله عليه وسلم قال:",
    "content": "المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي موسى رضي الله عنه، قال: قالوا يا رسول الله،أي الإسلام أفضل؟ قال:",
    "content": "من سلم المسلمون من لسانه، ويده."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد الله بن عمرو رضي الله عنهما، أن رجلا سأل النبي صلى الله عليه وسلم:أي الإسلام خير؟ قال:",
    "content": "تطعم الطعام، وتقرأ السلام على من عرفت ومن لم تعرف."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس عن النبي صلى الله عليه وسلم قال:",
    "content": "لا يؤمن أحدكم، حتى يحب لأخيه ما يحب لنفسه."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "فوالذي نفسي بيده، لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس، قال: قال النبي صلى الله عليه وسلم:",
    "content": "لا يؤمن أحدكم، حتى أكون أحب إليه من والده وولده والناس أجمعين."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس بن مالك رضي الله عنه، عن النبي صلى الله عليه وسلم قال:",
    "content": "ثلاث من كن فيه وجد حلاوة الإيمان: أن يكون الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا لله، وأن يكره أن يعود في الكفر كما يكره أن يقذف في النار."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس عن النبي صلى الله عليه وسلم قال:",
    "content": "آية الإيمان حب الأنصار، وآية النفاق بغض الأنصار."
  },
  {
    "section_id" : 1,
    "reference": "عن عبادة بن الصامت رضي الله عنه وكان شهد بدرا وهو أحد النقباء ليلة العقبة: أن رسول الله صلى الله عليه وسلم قال، وحوله عصابة من أصحابه:",
    "content": "بايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتوا ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوا في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب في الدنيا فهو كفارة له، ومن أصاب من ذلك شيئا ثم ستره الله فهو إلى الله، إن شاء عفا عنه وإن شاء عاقبه.فبايعناه على ذلك"
  },
  {
    "section_id" : 1,
    "reference": "عن أبي سعيد الخدري رضي الله عنه، أنه قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "يوشك أن يكون خير مال المسلم غنم يتبع بها شعف الجبال ومواقع القطر، يفر بدينه من الفتن."
  },
  {
    "section_id" : 1,
    "reference": "عن عائشة، قالت: كان رسول الله صلى الله عليه وسلم إذا أمرهم، أمرهم من الأعمال بما يطيقون، قالوا: إنا لسنا كهيئتك يا رسول الله، إن الله قد غفر لك ما تقدم من ذنبك وما تأخر، فيغضب حتى يعرف الغضب في وجهه، ثم يقول:",
    "content": "إن أتقاكم وأعلمكم بالله أنا."
  },
  {
    "section_id" : 1,
    "reference": "حدثنا عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم مر على رجل من الأنصار، وهو يعظ أخاه في الحياء، فقال رسول الله صلى الله عليه وسلم:",
    "content": "دعه فإن الحياء من الإيمان."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله، وأن محمدا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم سئل: أي العمل أفضل؟ فقال:",
    "content": "«إيمان بالله ورسوله».\nقيل: ثم ماذا؟ قال: «الجهاد في سبيل الله» قيل: ثم ماذا؟ قال: «حج مبرور»."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عباس، قال: قال النبي صلى الله عليه وسلم:",
    "content": "« أريت النار فإذا أكثر أهلها النساء، يكفرن» قيل: أيكفرن بالله؟ قال: \" يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر، ثم رأت منك شيئا، قالت: ما رأيت منك خيرا قط \"."
  },
  {
    "section_id" : 1,
    "reference": "عن ‌عبد الله قال: «لما نزلت: {الذين آمنوا ولم يلبسوا إيمانهم بظلم} قال أصحاب رسول الله صلى الله عليه وسلم: أينا لم يظلم؟ فأنزل الله:",
    "content": "{إن الشرك لظلم عظيم}."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة، عن النبي صلى الله عليه وسلم قال:",
    "content": "آية المنافق ثلاث: إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد الله بن عمرو أن النبي صلى الله عليه وسلم قال:",
    "content": "أربع من كن فيه كان منافقا خالصا، ومن كانت فيه خصلة منهن كانت فيه خصلة من النفاق حتى يدعها: إذا اؤتمن خان، وإذا حدث كذب، وإذا عاهد غدر، وإذا خاصم فجر."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة قال قال رسول الله صلى الله عليه وسلم:",
    "content": "من يقم ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "من قام رمضان إيمانا واحتسابا، غفر له ما تقدم من ذنبه."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من صام رمضان، إيمانا واحتسابا، غفر له ما تقدم من ذنبه."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة، عن النبي صلى الله عليه وسلم قال:",
    "content": "إن الدين يسر، ولن يشاد الدين أحد إلا غلبه، فسددوا وقاربوا، وأبشروا، واستعينوا بالغدوة والروحة وشيء من الدلجة."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "إذا أحسن أحدكم إسلامه: فكل حسنة يعملها تكتب له بعشر أمثالها إلى سبع مائة ضعف، وكل سيئة يعملها تكتب له بمثلها."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس، عن النبي صلى الله عليه وسلم قال:",
    "content": "يخرج من النار من قال لا إله إلا الله، وفي قلبه وزن شعيرة من خير، ويخرج من النار من قال لا إله إلا الله، وفي قلبه وزن برة من خير، ويخرج من النار من قال لا إله إلا الله، وفي قلبه وزن ذرة من خير."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد الله أن النبي صلى الله عليه وسلم قال:",
    "content": "سباب المسلم فسوق، وقتاله كفر."
  },
  {
    "section_id" : 1,
    "reference": "عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم خرج يخبر بليلة القدر، فتلاحى رجلان من المسلمين فقال:",
    "content": "إني خرجت لأخبركم بليلة القدر، وإنه تلاحى فلان وفلان، فرفعت، وعسى أن يكون خيرا لكم، التمسوها في السبع والتسع والخمس."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة، قال: كان النبي صلى الله عليه وسلم بارزا يوما للناس، فأتاه جبريل فقال: ما الإيمان؟ قال:",
    "content": "«الإيمان أن تؤمن بالله وملائكته، وكتبه، وبلقائه، ورسله وتؤمن بالبعث».\nقال: ما الإسلام؟ قال: \" الإسلام: أن تعبد الله، ولا تشرك به شيئا، وتقيم الصلاة، وتؤدي الزكاة المفروضة، وتصوم رمضان \".\nقال: ما الإحسان؟ قال: «أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك»، قال: متى الساعة؟ قال: \" ما المسئول عنها بأعلم من السائل، وسأخبرك عن أشراطها: إذا ولدت الأمة ربها، وإذا تطاول رعاة الإبل البهم في البنيان، في خمس لا يعلمهن إلا الله \" ثم تلا النبي صلى الله عليه وسلم: {إن الله عنده علم الساعة} ، ثم أدبر فقال: «ردوه» فلم يروا شيئا، فقال: «هذا جبريل جاء يعلم الناس دينهم»."
  },
  {
    "section_id" : 1,
    "reference": "عن النعمان بن بشير، يقول: سمعت رسول الله صلى الله عليه وسلم يقول:",
    "content": "الحلال بيّن، والحرام بيّن، وبينهما مشبهات لا يعلمها كثير من الناس، فمن اتقى المشبهات استبرأ لدينه وعرضه، ومن وقع في الشبهات: كراع يرعى حول الحمى، يوشك أن يواقعه، ألا وإن لكل ملك حمى، ألا إن حمى الله في أرضه محارمه، ألا وإن في الجسد مضغة: إذا صلحت صلح الجسد كله، وإذا فسدت فسد الجسد كله، ألا وهي القلب."
  },
  {
    "section_id" : 1,
    "reference": "عن عمر أن رسول الله صلى الله عليه وسلم قال:",
    "content": "الأعمال بالنية، ولكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي مسعود عن النبي صلى الله عليه وسلم قال:",
    "content": "إذا أنفق الرجل على أهله يحتسبها فهو له صدقة."
  },
  {
    "section_id" : 1,
    "reference": "عن سعد بن أبي وقاص، أنه أخبره أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إنك لن تنفق نفقة تبتغي بها وجه الله إلا أجرت عليها، حتى ما تجعل في فم امرأتك."
  },
  {
    "section_id" : 1,
    "reference": "عن جرير بن عبد الله، قال:",
    "content": "بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد الله بن عمرو، قال:",
    "content": "تخلف عنا النبي صلى الله عليه وسلم في سفرة سافرناها فأدركنا - وقد أرهقتنا الصلاة - ونحن نتوضأ، فجعلنا نمسح على أرجلنا، فنادى بأعلى صوته: «ويل للأعقاب من النار» مرتين أو ثلاثا."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عمر، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "«إن من الشجر شجرة لا يسقط ورقها، وإنها مثل المسلم، فحدثوني ما هي» فوقع الناس في شجر البوادي قال عبد الله: ووقع في نفسي أنها النخلة، فاستحييت، ثم قالوا: حدثنا ما هي يا رسول الله قال: «هي النخلة»."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي واقد الليثي، أن رسول الله صلى الله عليه وسلم بينما هو جالس في المسجد والناس معه إذ أقبل ثلاثة نفر، فأقبل اثنان إلى رسول الله صلى الله عليه وسلم وذهب واحد، قال:",
    "content": "فوقفا على رسول الله صلى الله عليه وسلم، فأما أحدهما: فرأى فرجة في الحلقة فجلس فيها، وأما الآخر: فجلس خلفهم، وأما الثالث: فأدبر ذاهبا، فلما فرغ رسول الله صلى الله عليه وسلم قال: «ألا أخبركم عن النفر الثلاثة؟ أما أحدهم فأوى إلى الله فآواه الله، وأما الآخر فاستحيا فاستحيا الله منه، وأما الآخر فأعرض فأعرض الله عنه»."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس بن مالك، عن النبي صلى الله عليه وسلم، قال:",
    "content": "يسروا ولا تعسروا، وبشروا، ولا تنفروا."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن شهاب، قال: قال حميد بن عبد الرحمن، سمعت معاوية، خطيبا يقول سمعت النبي صلى الله عليه وسلم يقول:",
    "content": "من يرد الله به خيرا يفقهه في الدين، وإنما أنا قاسم والله يعطي، ولن تزال هذه الأمة قائمة على أمر الله، لا يضرهم من خالفهم، حتى يأتي أمر الله."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد الله بن مسعود قال: قال النبي صلى الله عليه وسلم:",
    "content": "لا حسد إلا في اثنتين: رجل آتاه الله مالا فسلط على هلكته في الحق، ورجل آتاه الله الحكمة فهو يقضي بها ويعلمها."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عباس قال: ضمني رسول الله صلى الله عليه وسلم وقال:",
    "content": "اللهم علمه الكتاب."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة عن النبي صلى الله عليه وسلم قال:",
    "content": "«يقبض العلم، ويظهر الجهل والفتن، ويكثر الهرج»، قيل يا رسول الله، وما الهرج؟ فقال: «هكذا بيده فحرفها، كأنه يريد القتل»."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي مسعود الأنصاري قال:",
    "content": "قال رجل يا رسول الله، لا أكاد أدرك الصلاة مما يطول بنا فلان، فما رأيت النبي صلى الله عليه وسلم في موعظة أشد غضبا من يومئذ، فقال: «أيها الناس، إنكم منفرون، فمن صلى بالناس فليخفف، فإن فيهم المريض، والضعيف، وذا الحاجة»."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس بن مالك أن رسول الله صلى الله عليه وسلم خرج، فقام عبد الله بن حذافة فقال:",
    "content": "من أبي؟ فقال: «أبوك حذافة» ثم أكثر أن يقول: «سلوني» فبرك عمر على ركبتيه فقال: رضينا بالله ربا وبالإسلام دينا وبمحمد صلى الله عليه وسلم نبيا فسكت."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس عن النبي صلى الله عليه وسلم أنه كان",
    "content": "إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد العزيز، قال أنس: إنه ليمنعني أن أحدثكم حديثا كثيرا أن النبي صلى الله عليه وسلم قال:",
    "content": "من تعمد علي كذبا، فليتبوأ مقعده من النار."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة عن النبي صلى الله عليه وسلم قال:",
    "content": "تسموا باسمي ولا تكتنوا بكنيتي، ومن رآني في المنام فقد رآني، فإن الشيطان لا يتمثل في صورتي، ومن كذب علي متعمدا فليتبوأ مقعده من النار."
  },
  {
    "section_id" : 1,
    "reference": "عن أم سلمة، قالت: استيقظ النبي صلى الله عليه وسلم ذات ليلة فقال:",
    "content": "سبحان الله، ماذا أنزل الليلة من الفتن، وماذا فتح من الخزائن، أيقظوا صواحبات الحجر، فرب كاسية في الدنيا عارية في الآخرة."
  },
  {
    "section_id" : 1,
    "reference": "عن عبد الله بن عمر، قال: صلى بنا النبي صلى الله عليه وسلم العشاء في آخر حياته، فلما سلم قام، فقال:",
    "content": "أرأيتكم ليلتكم هذه، فإن رأس مائة سنة منها، لا يبقى ممن هو على ظهر الأرض أحد."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة، قال:",
    "content": "قلت: يا رسول الله، إني أسمع منك حديثا كثيرا أنساه؟ قال: «ابسط رداءك» فبسطته، قال: فغرف بيديه، ثم قال: «ضمه» فضممته، فما نسيت شيئا بعده."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس بن مالك، قال: ذكر لي أن النبي صلى الله عليه وسلم قال لمعاذ بن جبل:",
    "content": "من لقي الله لا يشرك به شيئا دخل الجنة»، قال: ألا أبشر الناس؟ قال: «لا إني أخاف أن يتكلوا."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عمر، عن النبي صلى الله عليه وسلم أن رجلا سأله: ما يلبس المحرم؟ فقال:",
    "content": "لا يلبس القميص، ولا العمامة، ولا السراويل، ولا البرنس، ولا ثوبا مسه الورس أو الزعفران، فإن لم يجد النعلين فليلبس الخفين، وليقطعهما حتى يكونا تحت الكعبين."
  },
  {
    "section_id" : 1,
    "reference": "عن ابي هريره قال: سمعت النبي صلى الله عليه وسلم يقول:",
    "content": "إن أمتي يدعون يوم القيامة غرا محجلين من آثار الوضوء، فمن استطاع منكم أن يطيل غرته فليفعل."
  },
  {
    "section_id" : 1,
    "reference": "عن ابن عباس، يبلغ النبي صلى الله عليه وسلم قال:",
    "content": "لو أن أحدكم إذا أتى أهله قال باسم الله، اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا، فقضي بينهما ولد لم يضره."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة عن النبي صلى الله عليه وسلم:",
    "content": "أن رجلا رأى كلبا يأكل الثرى من العطش، فأخذ الرجل خفه، فجعل يغرف له به حتى أرواه، فشكر الله له، فأدخله الجنة."
  },
  {
    "section_id" : 1,
    "reference": "عن عائشة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إذا نعس أحدكم وهو يصلي فليرقد، حتى يذهب عنه النوم، فإن أحدكم إذا صلى وهو ناعس، لا يدري لعله يستغفر فيسب نفسه."
  },
  {
    "section_id" : 1,
    "reference": "عن أنس عن النبي صلى الله عليه وسلم قال:",
    "content": "إذا نعس أحدكم في الصلاة فلينم، حتى يعلم ما يقرأ."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة عن النبي صلى الله عليه وسلم قال:",
    "content": "كل كلم يكلمه المسلم في سبيل الله، يكون يوم القيامة كهيئتها، إذ طعنت، تفجر دما، اللون لون الدم، والعرف عرف المسك."
  },
  {
    "section_id" : 1,
    "reference": "عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول:",
    "content": "نحن الآخرون السابقون."
  },
  {
    "section_id" : 1,
    "reference": "عن حذيفة، قال: كان النبي صلى الله عليه وسلم:",
    "content": "إذا قام من الليل، يشوص فاه بالسواك."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "كفى بالمرء كذبا أن يحدث بكل ما سمع."
  },
  {
    "section_id" : 2,
    "reference": "عن أبا هريرة، يقول: قال رسول الله صلى الله عليه وسلم:",
    "content": "يكون في آخر الزمان دجالون كذابون، يأتونكم من الأحاديث بما لم تسمعوا أنتم، ولا آباؤكم، فإياكم وإياهم، لا يضلونكم، ولا يفتنونكم."
  },
  {
    "section_id" : 2,
    "reference": "عن جابر، قال: أتى النبي صلى الله عليه وسلم النعمان بن قوقل، فقال:",
    "content": "يا رسول الله أرأيت إذا صليت المكتوبة، وحرمت الحرام، وأحللت الحلال، أأدخل الجنة؟ فقال النبي صلى الله عليه وسلم: «نعم»."
  },
  {
    "section_id" : 2,
    "reference": "عن ابن عمر، عن النبي صلى الله عليه وسلم، قال:",
    "content": "«بني الإسلام على خمسة، على أن يوحد الله، وإقام الصلاة، وإيتاء الزكاة، وصيام رمضان، والحج»، فقال رجل: الحج، وصيام رمضان، قال: «لا، صيام رمضان، والحج» هكذا سمعته من رسول الله صلى الله عليه وسلم."
  },
  {
    "section_id" : 2,
    "reference": "عن ابن عمر، عن النبي صلى الله عليه وسلم، قال:",
    "content": "بني الإسلام على خمس، على أن يعبد الله، ويكفر بما دونه، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان."
  },
  {
    "section_id" : 2,
    "reference": "عن ابن عباس، قال: قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم، فقالوا: يا رسول الله، إنا هذا الحي من ربيعة، وقد حالت بيننا، وبينك كفار مضر، فلا نخلص إليك إلا في شهر الحرام، فمرنا بأمر نعمل به، وندعو إليه من وراءنا، قال:",
    "content": " \" آمركم بأربع، وأنهاكم عن أربع: الإيمان بالله \"، ثم فسرها لهم، فقال: «شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا خمس ما غنمتم، وأنهاكم عن الدباء، والحنتم، والنقير، والمقير» زاد خلف في روايته: «شهادة أن لا إله إلا الله»."
  },
  {
    "section_id" : 2,
    "reference": "عن ابن عباس، أن رسول الله صلى الله عليه وسلم لما بعث معاذا إلى اليمن، قال:",
    "content": "إنك تقدم على قوم أهل كتاب، فليكن أول ما تدعوهم إليه عبادة الله عز وجل، فإذا عرفوا الله، فأخبرهم أن الله فرض عليهم خمس صلوات في يومهم وليلتهم، فإذا فعلوا، فأخبرهم أن الله قد فرض عليهم زكاة تؤخذ من أغنيائهم فترد على فقرائهم، فإذا أطاعوا بها، فخذ منهم وتوق كرائم أموالهم."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، عن رسول الله صلى الله عليه وسلم، قال:",
    "content": "أقاتل الناس حتى يشهدوا أن لا إله إلا الله، ويؤمنوا بي، وبما جئت به، فإذا فعلوا ذلك، عصموا مني دماءهم، وأموالهم إلا بحقها، وحسابهم على الله."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله بن عمر، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا، عصموا مني دماءهم، وأموالهم إلا بحقها، وحسابهم على الله."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم لعمه عند الموت: \" قل:",
    "content": "لا إله إلا الله، أشهد لك بها يوم القيامة، فأبى \"، فأنزل الله: {إنك لا تهدي من أحببت} [القصص: 56] الآية."
  },
  {
    "section_id" : 2,
    "reference": "عن عثمان، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من مات وهو يعلم أنه لا إله إلا الله، دخل الجنة."
  },
  {
    "section_id" : 2,
    "reference": "عن معاذ بن جبل، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "«يا معاذ، أتدري ما حق الله على العباد؟» قال: الله ورسوله أعلم، قال: «أن يعبد الله ولا يشرك به شيء»، قال: «أتدري ما حقهم عليه إذا فعلوا ذلك؟» فقال: الله ورسوله أعلم، قال: «أن لا يعذبهم»."
  },
  {
    "section_id" : 2,
    "reference": "عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم، يقول:",
    "content": "ذاق طعم الإيمان من رضي بالله ربا، وبالإسلام دينا، وبمحمد رسولا."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، عن النبي صلى الله عليه وسلم، قال:",
    "content": "الإيمان بضع وسبعون شعبة، والحياء شعبة من الإيمان."
  },
  {
    "section_id" : 2,
    "reference": "عن عمران بن حصين، يحدث عن النبي صلى الله عليه وسلم أنه قال:",
    "content": "الحياء لا يأتي إلا بخير."
  },
  {
    "section_id" : 2,
    "reference": "عن سفيان بن عبد الله الثقفي، قال:",
    "content": "قلت: يا رسول الله، قل لي في الإسلام قولا لا أسأل عنه أحدا بعدك - وفي حديث أبي أسامة غيرك - قال: \" قل: آمنت بالله، فاستقم \"."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله بن عمرو بن العاص، يقول: إن رجلا سأل رسول الله صلى الله عليه وسلم أي المسلمين خير؟ قال:",
    "content": "من سلم المسلمون من لسانه ويده."
  },
  {
    "section_id" : 2,
    "reference": "عن أنس عن النبي صلى الله عليه وسلم قال:",
    "content": "ثلاث من كن فيه وجد بهن حلاوة الإيمان: من كان الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا لله، وأن يكره أن يعود في الكفر بعد أن أنقذه الله منه، كما يكره أن يقذف في النار."
  },
  {
    "section_id" : 2,
    "reference": "عن أنس قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا يؤمن عبد - وفي حديث عبد الوارث: الرجل - حتى أكون أحب إليه من أهله وماله والناس أجمعين."
  },
  {
    "section_id" : 2,
    "reference": "عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال:",
    "content": "لا يؤمن أحدكم حتى يحب لأخيه - أو قال: لجاره - ما يحب لنفسه."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "لا يدخل الجنة من لا يأمن جاره بوائقه."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال:",
    "content": "من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت، ومن كان يؤمن بالله واليوم الآخر فليكرم جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي شريح الخزاعي، أن النبي صلى الله عليه وسلم قال:",
    "content": "من كان يؤمن بالله واليوم الآخر فليحسن إلى جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت."
  },
  {
    "section_id" : 2,
    "reference": "قال أبو هريرة قال رسول الله صلى الله عليه وسلم:",
    "content": "أتاكم أهل اليمن هم أضعف قلوبا وأرق أفئدة، الفقه يمان، والحكمة يمانية."
  },
  {
    "section_id" : 2,
    "reference": "عن تميم الداري أن النبي صلى الله عليه وسلم، قال:",
    "content": "«الدين النصيحة» قلنا: لمن؟ قال: «لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم»."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة أن النبي صلى الله عليه وسلم قال:",
    "content": "لا يزني الزاني حين يزني وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا يشرب الخمر حين يشربها وهو مؤمن، والتوبة معروضة بعد."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله بن عمرو، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "أربع من كن فيه كان منافقا خالصا، ومن كانت فيه خلة منهن كانت فيه خلة من نفاق حتى يدعها: إذا حدث كذب، وإذا عاهد غدر، وإذا وعد أخلف، وإذا خاصم فجر."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "آية المنافق ثلاث: إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان."
  },
  {
    "section_id" : 2,
    "reference": "عن ابن عمر، أن النبي صلى الله عليه وسلم قال:",
    "content": "إذا كفر الرجل أخاه فقد باء بها أحدهما."
  },
  {
    "section_id" : 2,
    "reference": "عن عراك بن مالك، أنه سمع أبا هريرة، يقول: إن رسول الله صلى الله عليه وسلم قال:",
    "content": "لا ترغبوا عن آبائكم، فمن رغب عن أبيه فهو كفر."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "اثنتان في الناس هما بهم كفر: الطعن في النسب والنياحة على الميت."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال:",
    "content": "ما أنزل الله من السماء من بركة إلا أصبح فريق من الناس بها كافرين، ينزل الله الغيث فيقولون: الكوكب كذا وكذا."
  },
  {
    "section_id" : 2,
    "reference": "عن عدي بن ثابت، قال: سمعت البراء يحدث عن النبي صلى الله عليه وسلم أنه قال في الأنصار:",
    "content": "لا يحبهم إلا مؤمن، ولا يبغضهم إلا منافق، من أحبهم أحبه الله ومن أبغضهم أبغضه الله."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي سفيان، قال: سمعت جابرا، يقول: سمعت النبي صلى الله عليه وسلم يقول:",
    "content": "إن بين الرجل وبين الشرك والكفر ترك الصلاة."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله بن مسعود، قال:",
    "content": "سألت رسول الله صلى الله عليه وسلم أي العمل أفضل؟ قال: «الصلاة لوقتها» قال: قلت ثم أي؟ قال: «بر الوالدين» قال: قلت: ثم أي؟ قال: «الجهاد في سبيل الله»."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله، عن النبي صلى الله عليه وسلم قال:",
    "content": "أفضل الأعمال - أو العمل - الصلاة لوقتها، وبر الوالدين."
  },
  {
    "section_id" : 2,
    "reference": "عن عمرو بن شرحبيل، قال: قال عبد الله، قال رجل:",
    "content": "يا رسول الله، أي الذنب أكبر عند الله؟ قال: «أن تدعو لله ندا وهو خلقك» قال: ثم أي؟ قال: «أن تقتل ولدك مخافة أن يطعم معك» قال: ثم أي؟ قال: «أن تزاني حليلة جارك» فأنزل الله عز وجل تصديقها: {والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق، ولا يزنون ومن يفعل ذلك يلق أثاما} [الفرقان: 68]."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "«اجتنبوا السبع الموبقات» قيل: يا رسول الله، وما هن؟ قال: «الشرك بالله، والسحر، وقتل النفس التي حرم الله إلا بالحق، وأكل مال اليتيم وأكل الربا، والتولي يوم الزحف، وقذف المحصنات الغافلات المؤمنات»."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال:",
    "content": "لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر."
  },
  {
    "section_id" : 2,
    "reference": "عن أبا ذر، يحدث عن النبي صلى الله عليه وسلم أنه قال:",
    "content": "أتاني جبريل عليه السلام فبشرني أنه من مات من أمتك لا يشرك بالله شيئا دخل الجنة، قلت: وإن زنى وإن سرق؟ قال: وإن زنى وإن سرق."
  },
  {
    "section_id" : 2,
    "reference": "عن حذيفة، أنه بلغه أن رجلا ينم الحديث فقال حذيفة: سمعت رسول الله صلى الله عليه وسلم يقول:",
    "content": "لا يدخل الجنة نمام."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "ثلاثة لا يكلمهم الله يوم القيامة ولا يزكيهم (قال أبو معاوية: ولا ينظر إليهم) ولهم عذاب أليم: شيخ زان.\nوملك كذاب.\nوعائل مستكبر."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، قال: قال رسول الله عليه وسلم:",
    "content": "إن الله يبعث ريحا من اليمن، ألين من الحرير، فلا تدع أحدا في قلبه (قال أبو علقمة: مثقال حبة.\nوقال عبد العزيز: مثقال ذرة) من إيمان إلا قبضته."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، قال:",
    "content": "لما نزلت على رسول الله صلى الله عليه وسلم: {لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير} [٢/البقرة/ آية ٢٨٤] قال فاشتد ذلك على أصحاب رسول الله صلى الله عليه وسلم فأتوا رسول الله صلى الله عليه وسلم.\nثم بركوا على الركب.\nفقالوا: أي رسول الله! كلفنا من الأعمال ما نطيق.\nالصلاة والصيام والجهاد والصدقة.\nوقد أنزلت عليك هذه الآية.\nولا نطيقها.\nقال رسول الله صلى الله عليه وسلم \"أتريدون أن تقولوا كما قال أهل الكتابين من قبلكم: سمعنا وعصينا؟ بل قولوا: سمعنا وأطعنا غفرانك ربنا وإليك المصير.\nفلما اقترأها القوم ذلت بها ألسنتهم.\nفأنزل الله في إثرها: {آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير} [٢ /البقرة/ آية ٢٨٥] فلما فعلوا ذلك نسخها الله تعالى.\nوأنزل الله عز وجل: لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا (قال: نعم) ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا (قال: نعم) ربنا ولا تحملنا ما لا طاقة لنا به (قال: نعم) واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين (قال: نعم) [٢/ البقرة/ آية ٢٨٦]."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة؛ قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "إن الله تجاوز لأمتي ما حدثت به أنفسها ما لم يتكلموا أو يعملوا به."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة؛ قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من هم بحسنة فلم يعملها كتبت له حسنة.\nومن هم بحسنة فعملها كتبت له عشرا إلى سبعمائة ضعف.\nومن هم بسيئة فلم يعملها، لم تكتب.\nوإن عملها كتبت."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله؛ قال: سئل النبي صلى الله عليه وسلم عن الوسوسة.\nقال:",
    "content": "تلك محض الإيمان."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة؛ قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "بدأ الإسلام غريبا وسيعود كما بدأ غريبا.\nفطوبى للغرباء."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة؛ أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة، عن رسول الله صلى الله عليه وسلم؛ أنه قال:",
    "content": "والذي نفسي محمد بيده! لا يسمع بي أحد من هذه الأمة يهودي ولا نصراني، ثم يموت ولم يؤمن بالذي أرسلت به، إلا كان من أصحاب النار."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "لا تقوم الساعة حتى تطلع الشمس من مغربها، فإذا طلعت من مغربها آمن الناس كلهم أجمعون فيومئذ {لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا} [الأنعام: 158]."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي ذر، قال: سألت رسول الله صلى الله عليه وسلم عن قول الله تعالى: {والشمس تجري لمستقر لها} [يس: 38]؟ قال:",
    "content": "مستقرها تحت العرش."
  },
  {
    "section_id" : 2,
    "reference": "عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "لما كذبتني قريش، قمت في الحجر، فجلا الله لي بيت المقدس، فطفقت أخبرهم عن آياته، وأنا أنظر إليه."
  },
  {
    "section_id" : 2,
    "reference": "حدثنا الشيباني، قال: سألت زر بن حبيش، عن قول الله عز وجل: {فكان قاب قوسين أو أدنى} [النجم: 9]، قال:",
    "content": "أخبرني ابن مسعود، «أن النبي صلى الله عليه وسلم رأى جبريل له ستمائة جناح»."
  },
  {
    "section_id" : 2,
    "reference": "عن عبد الله، قال: {ما كذب الفؤاد ما رأى} [النجم: 11]، قال:",
    "content": "رأى جبريل عليه السلام له ستمائة جناح."
  },
  {
    "section_id" : 2,
    "reference": "عن أبي موسى، قال: قام فينا رسول الله صلى الله عليه وسلم بأربع:",
    "content": "إن الله لا ينام ولا ينبغي له أن ينام، يرفع القسط ويخفضه، ويرفع إليه عمل النهار بالليل، وعمل الليل بالنهار."
  },
  {
    "section_id" : 2,
    "reference": "حدثنا أبو هريرة، عن رسول الله صلى الله عليه وسلم، فذكر أحاديث منها وقال رسول الله صلى الله عليه وسلم:",
    "content": "إن أدنى مقعد أحدكم من الجنة أن يقول له: تمن فيتمنى، ويتمنى، فيقول له: هل تمنيت؟ فيقول: نعم، فيقول له: فإن لك ما تمنيت ومثله معه."
  },
  {
    "section_id" : 2,
    "reference": "عن عمرو، سمع جابرا، يقول: سمعه من النبي صلى الله عليه وسلم بأذنه، يقول:",
    "content": "إن الله يخرج ناسا من النار فيدخلهم الجنة."
  },
  {
    "section_id" : 2,
    "reference": "عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "يخرج من النار أربعة فيعرضون على الله، فيلتفت أحدهم، فيقول: أي رب، إذ أخرجتني منها فلا تعدني فيها، فينجيه الله منها."
  },
  {
    "section_id" : 3,
    "reference": "عن زيد بن أرقم، عن رسول الله - صلى الله عليه وسلم - قال:",
    "content": "إن هذه الحشوش محتضرة فإذا أتى أحدكم الخلاء فليقل: أعوذ بالله من الخبث والخبائث."
  },
  {
    "section_id" : 3,
    "reference": "عن عائشة، قالت:",
    "content": "كان رسول الله صلى الله عليه وسلم يذكر الله عز وجل على كل أحيانه."
  },
  {
    "section_id" : 3,
    "reference": "عن حفصة زوج النبي صلى الله عليه وسلم:",
    "content": "أن النبي صلى الله عليه وسلم كان يجعل يمينه لطعامه وشرابه وثيابه، ويجعل شماله لما سوى ذلك."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، عن النبي صلى الله عليه وسلم، قال:",
    "content": " نزلت هذه الآية في أهل قباء: {فيه رجال يحبون أن يتطهروا}، قال: «كانوا يستنجون بالماء، فنزلت فيهم هذه الآية»."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، يرفعه، قال:",
    "content": "لولا أن أشق على المؤمنين، لأمرتهم بتأخير العشاء، وبالسواك عند كل صلاة."
  },
  {
    "section_id" : 3,
    "reference": "عن عائشة، قالت:",
    "content": "كان رسول الله صلى الله عليه وسلم يستن وعنده رجلان، أحدهما أكبر من الآخر، فأوحى الله إليه في فضل السواك، أن كبر أعط السواك أكبرهما."
  },
  {
    "section_id" : 3,
    "reference": "عن حذيفة:",
    "content": "أن رسول الله صلى الله عليه وسلم كان إذا قام من الليل يشوص فاه بالسواك."
  },
  {
    "section_id" : 3,
    "reference": "عن عائشة:",
    "content": "أن النبي صلى الله عليه وسلم كان لا يرقد من ليل ولا نهار، فيستيقظ إلا تسوك قبل أن يتوضأ."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي المليح، عن أبيه، عن النبي صلى الله عليه وسلم، قال:",
    "content": "لا يقبل الله عز وجل صدقة من غلول، ولا صلاة بغير طهور."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي غطيف الهذلي، قال:",
    "content": "كنت عند عبد الله بن عمر، فلما نودي بالظهر توضأ فصلى، فلما نودي بالعصر توضأ، فقلت له، فقال: كان رسول الله صلى الله عليه وسلم يقول: «من توضأ على طهر كتب الله له عشر حسنات»."
  },
  {
    "section_id" : 3,
    "reference": "عن ثوبان، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "ثلاث لا يحل لأحد أن يفعلهن: لا يؤم رجل قوما فيخص نفسه بالدعاء دونهم، فإن فعل فقد خانهم، ولا ينظر في قعر بيت قبل أن يستأذن، فإن فعل فقد دخل، ولا يصلي وهو حقن حتى يتخفف."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، يقول: سمعت رسول الله صلى الله عليه وسلم يقول:",
    "content": "إذا استيقظ أحدكم من نومه، فلا يدخل يده في الإناء حتى يغسلها ثلاث مرات، فإن أحدكم لا يدري أين باتت يده، أو أين كانت تطوف يده."
  },
  {
    "section_id" : 3,
    "reference": "عن عبد الرحمن بن أبي ليلى، قال:",
    "content": "رأيت عليا رضي الله عنه «توضأ فغسل وجهه ثلاثا، وغسل ذراعيه ثلاثا، ومسح برأسه واحدة»، ثم قال: «هكذا توضأ رسول الله صلى الله عليه وسلم»."
  },
  {
    "section_id" : 3,
    "reference": "عن عائشة قالت:",
    "content": "كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشيء من نحو الحلاب، فأخذ بكفيه فبدأ بشق رأسه الأيمن، ثم الأيسر، ثم أخذ بكفيه، فقال بهما على رأسه."
  },
  {
    "section_id" : 3,
    "reference": "عن امرأة من بني عبد الأشهل قالت: قلت:",
    "content": "يا رسول الله، إن لنا طريقا إلى المسجد منتنة فكيف نفعل إذا مطرنا؟ قال: «أليس بعدها طريق هي أطيب منها؟» قالت: قلت: بلى.\nقال: «فهذه بهذه»."
  },
  {
    "section_id" : 3,
    "reference": "عن ابن عباس قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "«أمني جبريل عليه السلام عند البيت مرتين، فصلى بي الظهر حين زالت الشمس وكانت قدر الشراك، وصلى بي العصر حين كان ظله مثله، وصلى بي يعني المغرب حين أفطر الصائم، وصلى بي العشاء حين غاب الشفق، وصلى بي الفجر حين حرم الطعام والشراب على الصائم، فلما كان الغد صلى بي الظهر حين كان ظله مثله، وصلى بي العصر حين كان ظله مثليه، وصلى بي المغرب حين أفطر الصائم، وصلى بي العشاء إلى ثلث الليل، وصلى بي الفجر فأسفر» ثم التفت إلي فقال: «يا محمد، هذا وقت الأنبياء من قبلك، والوقت ما بين هذين الوقتين»."
  },
  {
    "section_id" : 3,
    "reference": "عن مرثد بن عبد الله، قال:",
    "content": "لما قدم علينا أبو أيوب غازيا وعقبة بن عامر يومئذ على مصر فأخر المغرب فقام إليه أبو أيوب، فقال: له ما هذه الصلاة يا عقبة، فقال: شغلنا، قال: أما سمعت رسول الله صلى الله عليه وسلم يقول: «لا تزال أمتي بخير» أو قال: على الفطرة - ما لم يؤخروا المغرب إلى أن تشتبك النجوم."
  },
  {
    "section_id" : 3,
    "reference": "عن رافع بن خديج، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "أصبحوا بالصبح فإنه أعظم لأجوركم أو أعظم للأجر."
  },
  {
    "section_id" : 3,
    "reference": "عن أم فروة، قالت: سئل رسول الله صلى الله عليه وسلم أي الأعمال أفضل؟ قال:",
    "content": "الصلاة في أول وقتها."
  },
  {
    "section_id" : 3,
    "reference": "قال سعيد بن المسيب: إن أبا قتادة بن ربعي أخبره، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "قال الله تعالى: «إني فرضت على أمتك خمس صلوات وعهدت عندي عهدا أنه من جاء يحافظ عليهن لوقتهن أدخلته الجنة ومن لم يحافظ عليهن فلا عهد له عندي»."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي قتادة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "ليس في النوم تفريط إنما التفريط في اليقظة أن تؤخر صلاة حتى يدخل وقت أخرى."
  },
  {
    "section_id" : 3,
    "reference": "عن أنس بن مالك، أن النبي صلى الله عليه وسلم، قال:",
    "content": "من نسي صلاة فليصلها إذا ذكرها، لا كفارة لها إلا ذلك."
  },
  {
    "section_id" : 3,
    "reference": "عن أنس، أن النبي صلى الله عليه وسلم قال:",
    "content": "لا تقوم الساعة حتى يتباهى الناس في المساجد."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "الملائكة تصلي على أحدكم ما دام في مصلاه الذي صلى فيه، ما لم يحدث، أو يقم: اللهم اغفر له اللهم ارحمه."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم، قال:",
    "content": "لا يزال أحدكم في صلاة ما كانت الصلاة تحبسه، لا يمنعه أن ينقلب إلى أهله إلا الصلاة."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من أتى المسجد لشيء فهو حظه."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي سعيد، قال: قال رسول الله صلى الله عليه وسلم: - وقال موسى في حديثه فيما يحسب عمرو - إن النبي صلى الله عليه وسلم قال:",
    "content": "الأرض كلها مسجد إلا الحمام والمقبرة."
  },
  {
    "section_id" : 3,
    "reference": "عن أنس بن مالك، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا يرد الدعاء بين الأذان والإقامة."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إذا سمعتم النداء فقولوا مثل ما يقول المؤذن."
  },
  {
    "section_id" : 3,
    "reference": "عن سعد بن أبي وقاص، عن رسول الله صلى الله عليه وسلم، قال:",
    "content": "من قال: حين يسمع المؤذن وأنا أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدا عبده ورسوله، رضيت بالله ربا وبمحمد رسولا وبالإسلام دينا غفر له."
  },
  {
    "section_id" : 3,
    "reference": "عن أم سلمة، قالت: علمني رسول الله صلى الله عليه وسلم أن أقول عند أذان المغرب:",
    "content": "اللهم إن هذا إقبال ليلك، وإدبار نهارك، وأصوات دعاتك، فاغفر لي."
  },
  {
    "section_id" : 3,
    "reference": "عن عثمان بن عفان، قال: قال رسول الله صلى الله عليه وسلم::",
    "content": "من صلى العشاء في جماعة كان كقيام نصف ليلة، ومن صلى العشاء والفجر في جماعة كان كقيام ليلة."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، عن النبي صلى الله عليه وسلم قال:",
    "content": "الأبعد فالأبعد من المسجد أعظم أجرا."
  },
  {
    "section_id" : 3,
    "reference": "عن بريدة، عن النبي صلى الله عليه وسلم، قال:",
    "content": "بشر المشائين في الظلم إلى المساجد بالنور التام يوم القيامة."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من توضأ فأحسن وضوءه، ثم راح فوجد الناس قد صلوا أعطاه الله جل وعز مثل أجر من صلاها وحضرها لا ينقص ذلك من أجرهم شيئا."
  },
  {
    "section_id" : 3,
    "reference": "عن ابن عمر، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا تمنعوا نساءكم المساجد، وبيوتهن خير لهن."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي سعيد، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا يقطع الصلاة شيء وادرءوا ما استطعتم فإنما هو شيطان."
  },
  {
    "section_id" : 3,
    "reference": "عن وائل بن حجر، قال: رأيت النبي صلى الله عليه وسلم",
    "content": "حين افتتح الصلاة رفع يديه حيال أذنيه."
  },
  {
    "section_id" : 3,
    "reference": "عن أبي هريرة، أن النبي صلى الله عليه وسلم قال:",
    "content": "إذا صلى أحدكم للناس فليخفف فإن فيهم الضعيف والسقيم والكبير، وإذا صلى لنفسه فليطول ما شاء."
  },
  {
    "section_id" : 4,
    "reference": "عن جابر بن عبد الله قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "مفتاح الجنة الصلاة، ومفتاح الصلاة الوضوء."
  },
  {
    "section_id" : 4,
    "reference": "عن زيد بن خالد الجهني، قال: سمعت رسول الله صلى الله عليه وسلم، يقول:",
    "content": "لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة، ولأخرت صلاة العشاء إلى ثلث الليل."
  },
  {
    "section_id" : 4,
    "reference": "عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إذا توضأت فخلل بين أصابع يديك ورجليك."
  },
  {
    "section_id" : 4,
    "reference": "عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال:",
    "content": "إذا أتى أحدكم أهله، ثم أراد أن يعود، فليتوضأ بينهما وضوءا."
  },
  {
    "section_id" : 4,
    "reference": "عن القاسم بن غنام، عن عمته أم فروة - وكانت ممن بايعت النبي صلى الله عليه وسلم - قالت: سئل النبي صلى الله عليه وسلم أي الأعمال أفضل؟ قال:",
    "content": "الصلاة لأول وقتها."
  },
  {
    "section_id" : 4,
    "reference": "عن ابن عمر، عن النبي صلى الله عليه وسلم قال:",
    "content": "الذي تفوته صلاة العصر فكأنما وتر أهله وماله."
  },
  {
    "section_id" : 4,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "الصلوات الخمس، والجمعة إلى الجمعة، كفارات لما بينهن، ما لم تغش الكبائر."
  },
  {
    "section_id" : 4,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إن صلاة الرجل في الجماعة تزيد على صلاته وحده بخمسة وعشرين جزءا."
  },
  {
    "section_id" : 4,
    "reference": "عن جندب بن سفيان، عن النبي صلى الله عليه وسلم قال:",
    "content": "من صلى الصبح فهو في ذمة الله، فلا تخفروا الله في ذمته."
  },
  {
    "section_id" : 4,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "خير صفوف الرجال أولها، وشرها آخرها، وخير صفوف النساء آخرها، وشرها أولها."
  },
  {
    "section_id" : 4,
    "reference": "عن وابصة بن معبد:",
    "content": "أن رجلا صلى خلف الصف وحده فأمره النبي صلى الله عليه وسلم أن يعيد الصلاة."
  },
  {
    "section_id" : 4,
    "reference": "عن عائشة، قالت: كان النبي صلى الله عليه وسلم إذا افتتح الصلاة قال:",
    "content": "سبحانك اللهم وبحمدك، وتبارك اسمك، وتعالى جدك، ولا إله غيرك."
  },
  {
    "section_id" : 4,
    "reference": "عن أبي هريرة، عن النبي صلى الله عليه وسلم قال:",
    "content": "إذا أمن الإمام فأمنوا، فإنه من وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه."
  },
  {
    "section_id" : 4,
    "reference": "عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول:",
    "content": "إذا سجد العبد سجد معه سبعة آراب: وجهه، وكفاه، وركبتاه، وقدماه."
  },
  {
    "section_id" : 4,
    "reference": "عن البراء بن عازب:",
    "content": "أن النبي صلى الله عليه وسلم قرأ في العشاء الآخرة بالتين والزيتون."
  },
  {
    "section_id" : 4,
    "reference": "عن أبي سعيد الخدري، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا تشد الرحال إلا إلى ثلاثة مساجد: مسجد الحرام، ومسجدي هذا، ومسجد الأقصى."
  },
  {
    "section_id" : 4,
    "reference": "عن عائشة، قال: سألتها عن صلاة رسول الله صلى الله عليه وسلم عن تطوعه؟ قالت:",
    "content": "كان يصلي ليلا طويلا قائما، وليلا طويلا قاعدا، فإذا قرأ وهو قائم ركع وسجد وهو قائم، وإذا قرأ وهو جالس ركع وسجد وهو جالس."
  },
  {
    "section_id" : 4,
    "reference": "عن جابر، قال: قيل للنبي صلى الله عليه وسلم أي الصلاة أفضل؟ قال:",
    "content": "طول القنوت."
  },
  {
    "section_id" : 4,
    "reference": "عن عبد الله بن مسعود:",
    "content": "«أن النبي صلى الله عليه وسلم صلى الظهر خمسا»، فقيل له: أزيد في الصلاة أم نسيت؟ «فسجد سجدتين بعدما سلم»."
  },
  {
    "section_id" : 4,
    "reference": "عن المغيرة بن شعبة، قال:",
    "content": "«صلى رسول الله صلى الله عليه وسلم حتى انتفخت قدماه»، فقيل له: أتتكلف هذا وقد غفر لك ما تقدم من ذنبك وما تأخر، قال: «أفلا أكون عبدا شكورا»."
  },
  {
    "section_id" : 4,
    "reference": "عن عائشة، قالت: قال رسول الله صلى الله عليه وسلم:",
    "content": "ركعتا الفجر خير من الدنيا وما فيها."
  },
  {
    "section_id" : 4,
    "reference": "عن أم حبيبة، قالت: قال رسول الله صلى الله عليه وسلم:",
    "content": "من صلى قبل الظهر أربعا وبعدها أربعا حرمه الله على النار."
  },
  {
    "section_id" : 4,
    "reference": "عن عائشة:",
    "content": "«أن رسول الله صلى الله عليه وسلم كان يصلي من الليل إحدى عشرة ركعة يوتر منها بواحدة، فإذا فرغ منها اضطجع على شقه الأيمن»."
  },
  {
    "section_id" : 5,
    "reference": "عن أنس بن مالك قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "قد أكثرت عليكم في السواك."
  },
  {
    "section_id" : 5,
    "reference": "عن المقدام وهو ابن شريح، عن أبيه قال:",
    "content": "قلت لعائشة بأي شيء كان يبدأ النبي صلى الله عليه وسلم إذا دخل بيته؟ قالت: «بالسواك»."
  },
  {
    "section_id" : 5,
    "reference": "عن أبي هريرة قال: قال رسول الله صلى الله عليه وسلم \" خمس من الفطرة:",
    "content": "قص الشارب، ونتف الإبط، وتقليم الأظفار، والاستحداد، والختان."
  },
  {
    "section_id" : 5,
    "reference": "عن عائشة قالت: كان النبي صلى الله عليه وسلم يقول:",
    "content": "اللهم اغسل خطاياي بماء الثلج والبرد، ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس."
  },
  {
    "section_id" : 5,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إذا شرب الكلب في إناء أحدكم فليغسله سبع مرات."
  },
  {
    "section_id" : 5,
    "reference": "عن أنس قال: أتانا منادي رسول الله صلى الله عليه وسلم فقال:",
    "content": "إن الله ورسوله ينهاكم عن لحوم الحمر؛ فإنها رجس."
  },
  {
    "section_id" : 5,
    "reference": "عن عائشة رضي الله عنها قالت:",
    "content": "كنت أتعرق العرق «فيضع رسول الله صلى الله عليه وسلم فاه حيث وضعت وأنا حائض، وكنت أشرب من الإناء فيضع فاه حيث وضعت وأنا حائض»."
  },
  {
    "section_id" : 5,
    "reference": "عن أبي هريرة قال: قال أبو القاسم صلى الله عليه وسلم:",
    "content": "ويل للعقب من النار."
  },
  {
    "section_id" : 5,
    "reference": "عن سعد بن أبي وقاص، عن رسول الله صلى الله عليه وسلم:",
    "content": "أنه مسح على الخفين."
  },
  {
    "section_id" : 5,
    "reference": "عن صفوان بن عسال قال:",
    "content": "رخص لنا النبي صلى الله عليه وسلم إذا كنا مسافرين أن لا ننزع خفافنا ثلاثة أيام ولياليهن."
  },
  {
    "section_id" : 5,
    "reference": "عن عبد الله بن عمرو قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "أسبغوا الوضوء."
  },
  {
    "section_id" : 5,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "ألا أخبركم بما يمحو الله به الخطايا، ويرفع به الدرجات: إسباغ الوضوء على المكاره، وكثرة الخطا إلى المساجد، وانتظار الصلاة بعد الصلاة، فذلكم الرباط فذلكم الرباط فذلكم الرباط."
  },
  {
    "section_id" : 5,
    "reference": "عن عمر بن الخطاب رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من توضأ فأحسن الوضوء، ثم قال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله، فتحت له ثمانية أبواب الجنة يدخل من أيها شاء."
  },
  {
    "section_id" : 5,
    "reference": "عن عائشة رضي الله عنها قالت: قال رسول الله صلى الله عليه وسلم:",
    "content": "إذا نعس الرجل وهو في الصلاة فلينصرف، لعله يدعو على نفسه وهو لا يدري."
  },
  {
    "section_id" : 5,
    "reference": "عن عائشة رضي الله عنها:",
    "content": "أن النبي صلى الله عليه وسلم كان يقبل بعض أزواجه، ثم يصلي ولا يتوضأ."
  },
  {
    "section_id" : 5,
    "reference": "عن ابن عباس قال:",
    "content": "شهدت رسول الله صلى الله عليه وسلم أكل خبزا ولحما، ثم قام إلى الصلاة ولم يتوضأ."
  },
  {
    "section_id" : 5,
    "reference": "عن عائشة رضي الله عنها قالت:",
    "content": "كان النبي صلى الله عليه وسلم - وقال عمرو: كان رسول الله صلى الله عليه وسلم - إذا أراد أن يأكل أو ينام وهو جنب توضأ."
  },
  {
    "section_id" : 5,
    "reference": "عن علي رضي الله عنه، عن النبي صلى الله عليه وسلم قال:",
    "content": "لا تدخل الملائكة بيتا فيه صورة ولا كلب ولا جنب."
  },
  {
    "section_id" : 5,
    "reference": "عن أبي هريرة قال: كان رسول الله صلى الله عليه وسلم يقول:",
    "content": "اللهم اغسلني من خطاياي بالثلج والماء والبرد."
  },
  {
    "section_id" : 5,
    "reference": "عن كبشة بنت كعب بن مالك: أن أبا قتادة دخل عليها - ثم ذكر كلمة معناها - فسكبت له وضوءا، فجاءت هرة فشربت منه، فأصغى لها الإناء حتى شربت.\nقالت كبشة:",
    "content": "فرآني أنظر إليه فقال: أتعجبين يا ابنة أخي؟ قلت: نعم.\nقال: إن رسول الله صلى الله عليه وسلم قال: «إنها ليست بنجس , إنما هي من الطوافين عليكم والطوافات»."
  },
  {
    "section_id" : 5,
    "reference": "عن ابن أبي أوفى قال: كان النبي صلى الله عليه وسلم يقول:",
    "content": "«اللهم طهرني بالثلج والبرد والماء البارد.\nاللهم طهرني من الذنوب كما يطهر الثوب الأبيض من الدنس»."
  },
  {
    "section_id" : 5,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "تفضل صلاة الجمع على صلاة أحدكم وحده بخمسة وعشرين جزءا، ويجتمع ملائكة الليل والنهار في صلاة الفجر واقرءوا إن شئتم {وقرآن الفجر إن قرآن الفجر كان مشهودا} [الإسراء: ٧٨]."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "ما أمرتكم به فخذوه، وما نهيتكم عنه فانتهوا."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "ذروني ما تركتكم، فإنما هلك من كان قبلكم بسؤالهم واختلافهم على أنبيائهم، فإذا أمرتكم بشيء فخذوا منه ما استطعتم، وإذا نهيتكم عن شيء فانتهوا."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من أطاعني فقد أطاع الله، ومن عصاني فقد عصى الله."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي الدرداء، قال: خرج علينا رسول الله صلى الله عليه وسلم، ونحن نذكر الفقر ونتخوفه، فقال:",
    "content": "«آلفقر تخافون؟ والذي نفسي بيده، لتصبن عليكم الدنيا صبا، حتى لا يزيغ قلب أحدكم إزاغة إلا هيه، وايم الله، لقد تركتكم على مثل البيضاء، ليلها ونهارها سواء» قال أبو الدرداء: صدق والله رسول الله صلى الله عليه وسلم: «تركنا والله على مثل البيضاء، ليلها ونهارها سواء»."
  },
  {
    "section_id" : 6,
    "reference": "عن معاوية بن قرة، عن أبيه، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا تزال طائفة من أمتي منصورين، لا يضرهم من خذلهم حتى تقوم الساعة."
  },
  {
    "section_id" : 6,
    "reference": "حدثنا بكر بن زرعة، قال: سمعت أبا عنبة الخولاني، وكان قد صلى القبلتين، مع رسول الله صلى الله عليه وسلم قال: سمعت رسول الله صلى الله عليه وسلم يقول:",
    "content": "لا يزال الله يغرس في هذا الدين غرسا يستعملهم في طاعته."
  },
  {
    "section_id" : 6,
    "reference": "عن عمرو بن شعيب، عن أبيه، قال: قام معاوية، خطيبا فقال: أين علماؤكم؟ أين علماؤكم؟ سمعت رسول الله صلى الله عليه وسلم يقول:",
    "content": "لا تقوم الساعة إلا وطائفة من أمتي ظاهرين على الناس، لا يبالون من خذلهم ولا من نصرهم."
  },
  {
    "section_id" : 6,
    "reference": "عن ثوبان، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "لا يزال طائفة من أمتي على الحق منصورين، لا يضرهم من خالفهم، حتى يأتي أمر الله عز وجل."
  },
  {
    "section_id" : 6,
    "reference": "عن عائشة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "من أحدث في أمرنا هذا ما ليس منه فهو رد."
  },
  {
    "section_id" : 6,
    "reference": "عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "«لا تمنعوا إماء الله أن يصلين في المسجد» فقال ابن له: إنا لنمنعهن، فقال: فغضب غضبا شديدا، وقال: أحدثك عن رسول الله صلى الله عليه وسلم وتقول: إنا لنمنعهن؟."
  },
  {
    "section_id" : 6,
    "reference": "حدثنا عبد الله بن العلاء يعني ابن زبر قال: حدثني يحيى بن أبي المطاع، قال: سمعت العرباض بن سارية، يقول:",
    "content": "قام فينا رسول الله صلى الله عليه وسلم ذات يوم، فوعظنا موعظة بليغة، وجلت منها القلوب، وذرفت منها العيون، فقيل يا رسول الله: وعظتنا موعظة مودع، فاعهد إلينا بعهد، فقال: «عليكم بتقوى الله، والسمع والطاعة، وإن عبدا حبشيا، وسترون من بعدي اختلافا شديدا، فعليكم بسنتي، وسنة الخلفاء الراشدين المهديين، عضوا عليها بالنواجذ، وإياكم والأمور المحدثات، فإن كل بدعة ضلالة»."
  },
  {
    "section_id" : 6,
    "reference": "عن عائشة، قالت: تلا رسول الله صلى الله عليه وسلم هذه الآية {هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات} [آل عمران: ٧] إلى قوله، {وما يذكر إلا أولو الألباب} فقال:",
    "content": "يا عائشة، إذا رأيتم الذين يجادلون فيه، فهم الذين عناهم الله، فاحذروهم."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي أمامة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "«ما ضل قوم بعد هدى كانوا عليه إلا أوتوا الجدل» ثم تلا هذه الآية {بل هم قوم خصمون}."
  },
  {
    "section_id" : 6,
    "reference": "عن عبد الله بن عباس، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "أبى الله أن يقبل عمل صاحب بدعة حتى يدع بدعته."
  },
  {
    "section_id" : 6,
    "reference": "عن أنس بن مالك، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "من ترك الكذب وهو باطل، بني له قصر في ربض الجنة، ومن ترك المراء وهو محق، بني له في وسطها، ومن حسن خلقة، بني له في أعلاها."
  },
  {
    "section_id" : 6,
    "reference": "عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إن الله لا يقبض العلم انتزاعا ينتزعه من الناس، ولكن يقبض العلم بقبض العلماء، فإذا لم يبق عالما اتخذ الناس رءوسا جهالا، فسئلوا فأفتوا بغير علم، فضلوا وأضلوا."
  },
  {
    "section_id" : 6,
    "reference": "عن عبد الله بن عمرو، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "العلم ثلاثة، فما وراء ذلك فهو فضل: آية محكمة، أو سنة قائمة، أو فريضة عادلة."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "الإيمان بضع وستون أو سبعون بابا، أدناها إماطة الأذى عن الطريق، وأرفعها قول لا إله إلا الله، والحياء شعبة من الإيمان."
  },
  {
    "section_id" : 6,
    "reference": "عن عبد الله، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا يدخل الجنة من كان في قلبه مثقال ذرة من خردل من كبر، ولا يدخل النار من كان في قلبه مثقال حبة من خردل من إيمان."
  },
  {
    "section_id" : 6,
    "reference": "عن جندب بن عبد الله، قال:",
    "content": "كنا مع النبي صلى الله عليه وسلم ونحن فتيان حزاورة، «فتعلمنا الإيمان قبل أن نتعلم القرآن، ثم تعلمنا القرآن فازددنا به إيمانا»."
  },
  {
    "section_id" : 6,
    "reference": "عن ابن عباس، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "صنفان من هذه الأمة ليس لهما في الإسلام نصيب: المرجئة والقدرية."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال: كان رسول الله صلى الله عليه وسلم يوما بارزا للناس، فأتاه رجل، فقال: يا رسول الله، ما الإيمان؟ قال:",
    "content": "«أن تؤمن بالله، وملائكته، وكتبه، ورسله، ولقائه، وتؤمن بالبعث الآخر» قال: يا رسول الله، ما الإسلام؟ قال: «أن تعبد الله، ولا تشرك به شيئا، وتقيم الصلاة المكتوبة، وتؤدي الزكاة المفروضة، وتصوم رمضان» قال: يا رسول الله، ما الإحسان؟ قال: «أن تعبد الله كأنك تراه، فإنك إن لا تراه فإنه يراك» قال: يا رسول الله، متى الساعة؟ قال: «ما المسئول عنها بأعلم من السائل، ولكن سأحدثك عن أشراطها، إذا ولدت الأمة ربتها، فذلك من أشراطها، وإذا تطاول رعاء الغنم في البنيان، فذلك من أشراطها، في خمس لا يعلمهن إلا الله» ، فتلا رسول الله صلى الله عليه وسلم: {إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأي أرض تموت إن الله عليم خبير} [لقمان: ٣٤]."
  },
  {
    "section_id" : 6,
    "reference": "عن علي بن أبي طالب، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "الإيمان معرفة بالقلب، وقول باللسان، وعمل بالأركان."
  },
  {
    "section_id" : 6,
    "reference": "عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "لا يؤمن أحدكم حتى يحب لأخيه - أو قال لجاره - ما يحب لنفسه."
  },
  {
    "section_id" : 6,
    "reference": "عن ابن عباس، وعن جابر بن عبد الله، قالا: قال رسول الله صلى الله عليه وسلم:",
    "content": "صنفان من أمتي ليس لهما في الإسلام نصيب: أهل الإرجاء، وأهل القدر."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم::",
    "content": "المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجز، فإن أصابك شيء، فلا تقل: لو أني فعلت كذا وكذا، ولكن قل: قدر الله، وما شاء فعل، فإن لو تفتح عمل الشيطان."
  },
  {
    "section_id" : 6,
    "reference": "عن علي، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا يؤمن عبد حتى يؤمن بأربع: بالله وحده لا شريك له، وأني رسول الله، وبالبعث بعد الموت، والقدر."
  },
  {
    "section_id" : 6,
    "reference": "عن عائشة أم المؤمنين، قالت: دعي رسول الله صلى الله عليه وسلم إلى جنازة غلام من الأنصار، فقلت: يا رسول الله، طوبى لهذا، عصفور من عصافير الجنة، لم يعمل السوء، ولم يدركه، قال:",
    "content": "أوغير ذلك يا عائشة، «إن الله خلق للجنة أهلا، خلقهم لها وهم في أصلاب آبائهم، وخلق للنار أهلا، خلقهم لها وهم في أصلاب آبائهم»."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال:",
    "content": "جاء مشركو قريش يخاصمون النبي صلى الله عليه وسلم في القدر، فنزلت هذه الآية: {يوم يسحبون في النار على وجوههم ذوقوا مس سقر إنا كل شيء خلقناه بقدر} [القمر: ٤٩]."
  },
  {
    "section_id" : 6,
    "reference": "عن ابن عمر، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "«لا عدوى ولا طيرة، ولا هامة» فقام إليه رجل أعرابي، فقال: يا رسول الله، أرأيت البعير يكون به الجرب، فيجرب الإبل كلها؟ قال: «ذلكم القدر، فمن أجرب الأول؟»."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي موسى الأشعري، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "مثل القلب مثل الريشة تقلبها الرياح بفلاة."
  },
  {
    "section_id" : 6,
    "reference": "عن ثوبان، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "لا يزيد في العمر إلا البر، ولا يرد القدر إلا الدعاء، وإن الرجل ليحرم الرزق بخطيئة يعملها."
  },
  {
    "section_id" : 6,
    "reference": "عن عبد الله، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "ألا إني أبرأ إلى كل خليل من خلته، ولو كنت متخذا خليلا، لاتخذت أبا بكر خليلا، إن صاحبكم خليل الله."
  },
  {
    "section_id" : 6,
    "reference": "عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "«ما نفعني مال قط، ما نفعني مال أبي بكر» قال: فبكى أبو بكر، وقال: يا رسول الله، هل أنا ومالي إلا لك يا رسول الله."
  },
  {
    "section_id" : 7,
    "reference": "عن زيد بن أسلم، عن عطاء بن يسار، أنه قال: جاء رجل إلى رسول الله صلى الله عليه وسلم، فسأله عن وقت صلاة الصبح.\nقال:",
    "content": "فسكت عنه رسول الله صلى الله عليه وسلم حتى إذا كان من الغد، صلى الصبح حين طلع الفجر، ثم صلى الصبح من الغد بعد أن أسفر.\nثم قال: «أين السائل عن وقت الصلاة؟» قال: هأنذا يا رسول الله فقال: «ما بين هذين وقت»."
  },
  {
    "section_id" : 7,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "من أدرك ركعة من الصلاة فقد أدرك الصلاة."
  },
  {
    "section_id" : 7,
    "reference": "عن نافع، أن عبد الله بن عمر بن الخطاب كان يقول:",
    "content": "إذا فاتتك الركعة فقد فاتتك السجدة."
  },
  {
    "section_id" : 7,
    "reference": "عن عبد الله بن عمر أن رسول الله صلى الله عليه وسلم قال:",
    "content": "الذي تفوته صلاة العصر كأنما وتر أهله وماله."
  },
  {
    "section_id" : 7,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إذا استيقظ أحدكم من نومه فليغسل يده قبل أن يدخلها في وضوئه، فإن أحدكم لا يدري أين باتت يده."
  },
  {
    "section_id" : 7,
    "reference": "عن نعيم بن عبد الله المدني المجمر، أنه سمع أبا هريرة يقول:",
    "content": "«من توضأ فأحسن وضوءه، ثم خرج عامدا إلى الصلاة، فإنه في صلاة مادام يعمد إلى الصلاة.\nوإنه يكتب له بإحدى خطوتيه حسنة، ويمحى عنه بالأخرى سيئة.\nفإذا سمع أحدكم الإقامة فلا يسع.\nفإن أعظمكم أجرا أبعدكم دارا»، قالوا: لم يا أبا هريرة؟ قال: «من أجل كثرة الخطا»."
  },
  {
    "section_id" : 7,
    "reference": "عن يزيد بن عبد الله بن قسيط الليثي، أنه رأى سعيد بن المسيب:",
    "content": "رعف وهو يصلي، فأتى حجرة أم سلمة زوج النبي صلى الله عليه وسلم، فأتي بوضوء فتوضأ، ثم رجع فبنى على ما قد صلى."
  },
  {
    "section_id" : 7,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال::",
    "content": "من أدرك ركعة من الصلاة فقد أدرك الصلاة."
  },
  {
    "section_id" : 7,
    "reference": "رعف وهو يصلي، فأتى حجرة أم سلمة زوج النبي صلى الله عليه وسلم، فأتي بوضوء فتوضأ، ثم رجع فبنى على ما قد صلى",
    "content": "إذا جاوز الختان الختان فقد وجب الغسل."
  },
  {
    "section_id" : 7,
    "reference": "عن نافع، أنه أقبل هو وعبد الله بن عمر من الجرف حتى إذا كانا بالمربد نزل عبد الله:",
    "content": "فتيمم صعيدا طيبا، فمسح وجهه، ويديه إلى المرفقين ثم صلى."
  },
  {
    "section_id" : 7,
    "reference": "عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال:",
    "content": "لو يعلم الناس ما في النداء والصف الأول، ثم لم يجدوا إلا أن يستهموا عليه لاستهموا ولو يعلمون ما في التهجير لاستبقوا إليه، ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا."
  },
  {
    "section_id" : 7,
    "reference": "عن سهل بن سعد الساعدي أنه قال:",
    "content": "ساعتان يفتح لهما أبواب السماء، وقل داع ترد عليه دعوته: حضرة النداء للصلاة، والصف في سبيل الله."
  },
  {
    "section_id" : 7,
    "reference": "عن مالك عن عمه أبي سهيل بن مالك، عن أبيه أنه قال:",
    "content": "ما أعرف شيئا مما أدركت عليه الناس، إلا النداء بالصلاة."
  },
  {
    "section_id" : 7,
    "reference": "عن نافع، أن عبد الله بن عمر:",
    "content": "سمع الإقامة وهو بالبقيع فأسرع المشي إلى المسجد."
  },
  {
    "section_id" : 7,
    "reference": "عن نافع، أن عبد الله بن عمر كان:",
    "content": "إذا افتتح الصلاة، رفع يديه حذو منكبيه.\nوإذا رفع رأسه من الركوع، رفعهما دون ذلك."
  },
  {
    "section_id" : 7,
    "reference": "عن أبي نعيم وهب بن كيسان، عن جابر بن عبد الله أنه كان يعلمهم التكبير في الصلاة، قال:",
    "content": "يأمرنا أن نكبر كلما خفضنا ورفعنا."
  },
  {
    "section_id" : 7,
    "reference": "عن عدي بن ثابت الأنصاري عن البراء بن عازب أنه قال:",
    "content": "صليت مع رسول الله صلى الله عليه وسلم العشاء، فقرأ فيها بالتين والزيتون."
  },
  {
    "section_id" : 7,
    "reference": "عن علي بن أبي طالب، أن رسول الله صلى الله عليه وسلم:",
    "content": "نهى عن لبس القسي، وعن تختم الذهب، وعن قراءة القرآن في الركوع."
  },
  {
    "section_id" : 7,
    "reference": "عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال:",
    "content": "إذا أمن الإمام فأمنوا، فإنه من وافق تأمينه تأمين الملائكة غفر له ما تقدم من ذنبه."
  },
  {
    "section_id" : 7,
    "reference": " عن عبد الرحمن بن عبد القاري، أنه سمع عمر بن الخطاب وهو على المنبر يعلم الناس التشهد، يقول: قولوا:",
    "content": "التحيات لله، الزاكيات لله، الطيبات الصلوات لله، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله.\nوأشهد أن محمدا عبده ورسوله."
  },
  {
    "section_id" : 8,
    "reference": "عن عبد الله رضي الله عنه قال: قال رجل: يا رسول الله أيؤاخذ الرجل بما عمل في الجاهلية؟ قال:",
    "content": "من أحسن في الإسلام لم يؤاخذ بما كان عمل في الجاهلية، ومن أساء في الإسلام، أخذ بالأول والآخر."
  },
  {
    "section_id" : 8,
    "reference": "عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان:",
    "content": "يخطب إلى جذع فلما اتخذ المنبر حن الجذع حتى أتاه فمسحه."
  },
  {
    "section_id" : 8,
    "reference": "عن ابن عباس رضي الله عنهما، قال:",
    "content": "جلس ناس من أصحاب النبي صلى الله عليه وسلم ينتظرونه فخرج حتى إذا دنا منهم، سمعهم يتذاكرون، فتسمع حديثهم، فإذا بعضهم يقول: عجبا إن الله اتخذ من خلقه خليلا فإبراهيم خليله، وقال آخر: ماذا بأعجب من {وكلم الله موسى تكليما} [النساء: 164] وقال آخر: فعيسى كلمة الله وروحه، وقال آخر: وآدم اصطفاه الله، فخرج عليهم فسلم وقال: «قد سمعت كلامكم وعجبكم، أن إبراهيم خليل الله، وهو كذلك، وموسى نجيه، وهو كذلك، وعيسى روحه وكلمته، وهو كذلك، وآدم اصطفاه الله تعالى، وهو كذلك، ألا وأنا حبيب الله، ولا فخر، وأنا حامل لواء الحمد يوم القيامة، ولا فخر، وأنا أول شافع، وأول مشفع يوم القيامة ولا فخر، وأنا أول من يحرك بحلق الجنة ولا فخر، فيفتح الله فيدخلنيها ومعي فقراء المؤمنين ولا فخر، وأنا أكرم الأولين والآخرين على الله، ولا فخر»."
  },
  {
    "section_id" : 8,
    "reference": "عن جابر بن عبد الله رضي الله عنهما أن النبي صلى الله عليه وسلم قال:",
    "content": "أنا قائد المرسلين ولا فخر، وأنا خاتم النبيين ولا فخر، وأنا أول شافع وأول مشفع ولا فخر."
  },
  {
    "section_id" : 8,
    "reference": "عن أنس رضي الله عنه، قال: قال رسول الله صلى الله عليه وسلم:",
    "content": "أنا أول شفيع في الجنة."
  },
  {
    "section_id" : 8,
    "reference": "عن جابر بن سمرة رضي الله عنه، قال:",
    "content": "«رأيت رسول الله صلى الله عليه وسلم في ليلة إضحيان وعليه حلة حمراء فجعلت أنظر إليه وإلى القمر،» قال: فلهو كان أحسن في عيني من القمر."
  },
  {
    "section_id" : 8,
    "reference": "عن ابن عباس رضي الله عنهما، قال:",
    "content": "كان رسول الله صلى الله عليه وسلم أفلج الثنيتين، إذا تكلم رئي كالنور يخرج من بين ثناياه."
  },
  {
    "section_id" : 8,
    "reference": "عن عبد الملك بن عمير، قال قال ابن عمر رضي الله عنهما:",
    "content": "ما رأيت أحدا أنجد، ولا أجود، ولا أشجع، ولا أضوأ من رسول الله صلى الله عليه وسلم."
  },
  {
    "section_id" : 8,
    "reference": "عن أبي عبيدة بن محمد بن عمار بن ياسر، قال:",
    "content": "قلت للربيع بنت معوذ ابن عفراء: \" صفي لنا رسول الله صلى الله عليه وسلم فقالت: يا بني لو رأيته، رأيت الشمس طالعة."
  },
  {
    "section_id" : 8,
    "reference": "عن أنس رضي الله عنه، قال:",
    "content": "كان رسول الله صلى الله عليه وسلم أزهر اللون كأن عرقه اللؤلؤ، إذا مشى تكفأ، وما مسست حريرة ولا ديباجة ألين من كفه، ولا شممت رائحة قط أطيب من رائحته."
  },
  {
    "section_id" : 8,
    "reference": "عن البراء قال: سأله رجل:",
    "content": "أرأيت كان وجه رسول الله صلى الله عليه وسلم مثل السيف؟ قال: لا، مثل القمر."
  },
  {
    "section_id" : 8,
    "reference": "عن الزهري قال إن جبريل قال:",
    "content": "ما في الأرض أهل عشرة أبيات إلا قلبتهم، فما وجدت أحدا أشد إنفاقا لهذا المال من رسول الله صلى الله عليه وسلم."
  },
  {
    "section_id" : 8,
    "reference": "عن عبد الله بن أبي أوفى رضي الله عنه، قال:",
    "content": "كان النبي صلى الله عليه وسلم يكثر الذكر ويقل اللغو، ويطيل الصلاة، ويقصر الخطبة، ولا يأنف ولا يستنكف أن يمشي مع الأرملة، والمسكين فيقضي لهما حاجتهما."
  },
  {
    "section_id" : 8,
    "reference": "عن داود بن علي، قال: قيل: يا رسول الله ألا نحجبك؟ فقال:",
    "content": "لا دعوهم يطؤون عقبي وأطأ أعقابهم حتى يريحني الله منهم."
  },
  {
    "section_id" : 8,
    "reference": "حدثني مكحول: أن النبي صلى الله عليه وسلم قال:",
    "content": "إذا أصاب أحدكم مصيبة، فليذكر مصيبته بي، فإنها من أعظم المصائب."
  },
  {
    "section_id" : 8,
    "reference": "عن أبي هريرة، عن النبي صلى الله عليه وسلم:",
    "content": "أن هذه السورة لما أنزلت على رسول الله صلى الله عليه وسلم {إذا جاء نصر الله والفتح ورأيت الناس يدخلون في دين الله أفواجا} [النصر: 2] قال رسول الله صلى الله عليه وسلم: «ليخرجن منه أفواجا كما دخلوه أفواجا»."
  },
  {
    "section_id" : 8,
    "reference": "عن سعيد بن عبد العزيز، قال:",
    "content": "لما كان أيام الحرة لم يؤذن في مسجد النبي صلى الله عليه وسلم ثلاثا، ولم يقم، ولم يبرح سعيد بن المسيب المسجد، وكان لا يعرف وقت الصلاة إلا بهمهمة يسمعها من قبر النبي صلى الله عليه وسلم فذكر معناه."
  },
  {
    "section_id" : 8,
    "reference": "عن عبد الله بن الديلمي، قال:",
    "content": "بلغني أن « أول ذهاب الدين ترك السنة، يذهب الدين سنة سنة، كما يذهب الحبل قوة قوة»."
  },
  {
    "section_id" : 8,
    "reference": "عن حسان، قال:",
    "content": "ما ابتدع قوم بدعة في دينهم إلا نزع الله من سنتهم مثلها ثم لا يعيدها إليهم إلى يوم القيامة."
  },
  {
    "section_id" : 8,
    "reference": "عن أبي قلابة، قال:",
    "content": "ما ابتدع رجل بدعة إلا استحل السيف."
  },
  {
    "section_id" : 8,
    "reference": "عن القاسم قال:",
    "content": "لأن يعيش الرجل جاهلا بعد أن يعلم حق الله عليه خير له من أن يقول ما لا يعلم."
  },
  {
    "section_id" : 8,
    "reference": "عن أيوب، قال: سمعت القاسم، سئل قال:",
    "content": "إنا والله ما نعلم كل ما تسألون عنه، ولو علمنا ما كتمناكم، ولا حل لنا أن نكتمكم."
  },
  {
    "section_id" : 8,
    "reference": "عن يحيى قال: قلت للقاسم: ما أشد علي أن تسأل عن الشيء لا يكون عندك، وقد كان أبوك إماما، قال:",
    "content": "إن أشد من ذلك عند الله وعند من عقل عن الله أن أفتي بغير علم أو أروي عن غير ثقة."
  }
]